In [55]:
import pandas as pd
import numpy as np

In [56]:
#create and display a one-dimensional array-like object containing an array of data

In [57]:
n_series=pd.Series([10,20,30,40,50])
print(f"Array: {n_series.values}")

Array: [10 20 30 40 50]

In [58]:
#convert a Pandas module Series to Python list and it’s type

In [59]:
s_series=pd.Series([10,20,30,40,50])
print("pd_series:",s_series)
l1=(s_series.tolist())
print(l1)
print("Type:",type(l1))

pd_series: 0    10
1    20
2    30
3    40
4    50
dtype: int64
[10, 20, 30, 40, 50]
Type: <class 'list'>

In [60]:
#program to add, subtract, multiple and divide two Pandas Series

In [61]:
n1_series = pd.Series([2,4,6,8,10])
n2_series = pd.Series([1,3,5,7,9])
print("Addition:")
print(n1_series+n2_series)
print("Substraction:")
print(n1_series-n2_series)
print("Multiplication:")
print(n1_series*n2_series)
print("Divison:")
print(n1_series/n2_series)

Addition:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Substraction:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divison:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [62]:
#to convert a dictionary to a Pandas series

In [63]:
d = {'a':10,'b':20,'c':30,'d':40}
s_series=pd.Series(d,index=['b','d','a','c'])
print("pd_series:",s_series)

pd_series: b    20
d    40
a    10
c    30
dtype: int64

In [64]:
#convert a Numpy array to a Pandas series

In [65]:
arr1 = np.array ([10,20,30,40,50])
s_series = pd.Series(arr1)
print("Panda Series:",s_series)

Panda Series: 0    10
1    20
2    30
3    40
4    50
dtype: int64

In [66]:
#to change the data type of given a column or a Series

In [67]:
n_series=pd.Series([10,20,30,40,50])
print(f"series: {n_series.values}")
print(f"Original:{n_series.dtypes}")
print(f"Changed Datatype:{n_series.astype('int32').dtypes}")

series: [10 20 30 40 50]
Original:int64
Changed Datatype:int32

In [68]:
#convert a given Series to an array

In [69]:
n_series=pd.Series([10,20,30,40,50])
print(f"series: {n_series.values}")
n_series=np.array(n_series)
print(n_series)
print(type(n_series))

series: [10 20 30 40 50]
[10 20 30 40 50]
<class 'numpy.ndarray'>

In [70]:
#create a dataframe from a dictionary and display it

In [71]:
person ={
    'Name' :['abc','def','ghi'],
    'Age' :[22,23,24],
    'University' :['x','y','z'],
}
df = pd.DataFrame(person)
print(df)

  Name  Age University
0  abc   22          x
1  def   23          y
2  ghi   24          z

In [72]:
#Create a list of empids and names (10 employees) and perform operations

In [73]:
df = pd.read_csv('./MyRecord.csv')
df['bonus'] = df['Salary'] * 0.10
print(df)

    YearsExperience  Salary    bonus
0               1.1   39343   3934.3
1               1.3   46205   4620.5
2               1.5   37731   3773.1
3               2.0   43525   4352.5
4               2.2   39891   3989.1
5               2.9   56642   5664.2
6               3.0   60150   6015.0
7               3.2   54445   5444.5
8               3.2   64445   6444.5
9               3.7   57189   5718.9
10              3.9   63218   6321.8
11              4.0   55794   5579.4
12              4.0   56957   5695.7
13              4.1   57081   5708.1
14              4.5   61111   6111.1
15              4.9   67938   6793.8
16              5.1   66029   6602.9
17              5.3   83088   8308.8
18              5.9   81363   8136.3
19              6.0   93940   9394.0
20              6.8   91738   9173.8
21              7.1   98273   9827.3
22              7.9  101302  10130.2
23              8.2  113812  11381.2
24              8.7  109431  10943.1
25              9.0  105582  10558.2
26              9.5  116969  11696.9
27              9.6  112635  11263.5
28             10.3  122391  12239.1
29             10.5  121872  12187.2
30             11.0  140000  14000.0
31             12.0  155000  15500.0
32             13.0  156000  15600.0

In [74]:
#perform following tasks
df= pd.read_csv('./Advertising.csv')

In [102]:
df.head(5)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [103]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [104]:
print(df.tail(3))

    YearsExperience  Salary
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [106]:
df.dtypes

YearsExperience    float64
Salary               int64
dtype: object

In [107]:
df.isna().sum()

YearsExperience    0
Salary             0
dtype: int64

In [81]:
df.drop('Radio',axis=1)

      ID     TV  Newspaper  Sales
0      1  230.1       69.2   22.1
1      2   44.5       45.1   10.4
2      3   17.2       69.3    9.3
3      4  151.5       58.5   18.5
4      5  180.8       58.4   12.9
..   ...    ...        ...    ...
195  196   38.2       13.8    7.6
196  197   94.2        8.1    9.7
197  198  177.0        6.4   12.8
198  199  283.6       66.2   25.5
199  200  232.1        8.7   13.4

[200 rows x 4 columns]

In [82]:
df['updated_sales'] = df['Sales'] * 0.10
print(df)

      ID     TV  Radio  Newspaper  Sales  updated_sales
0      1  230.1   37.8       69.2   22.1           2.21
1      2   44.5   39.3       45.1   10.4           1.04
2      3   17.2   45.9       69.3    9.3           0.93
3      4  151.5   41.3       58.5   18.5           1.85
4      5  180.8   10.8       58.4   12.9           1.29
..   ...    ...    ...        ...    ...            ...
195  196   38.2    3.7       13.8    7.6           0.76
196  197   94.2    4.9        8.1    9.7           0.97
197  198  177.0    9.3        6.4   12.8           1.28
198  199  283.6   42.0       66.2   25.5           2.55
199  200  232.1    8.6        8.7   13.4           1.34

[200 rows x 6 columns]

In [83]:
shape = df.shape
print("Shape = {}".format(shape))

Shape = (200, 6)

In [84]:
df.describe()

,ID,TV,Radio,Newspaper,Sales,updated_sales
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,100.500000,147.042500,23.264000,30.554000,14.022500,1.402250
std,57.879185,85.854236,14.846809,21.778621,5.217457,0.521746
min,1.000000,0.700000,0.000000,0.300000,1.600000,0.160000
25%,50.750000,74.375000,9.975000,12.750000,10.375000,1.037500
50%,100.500000,149.750000,22.900000,25.750000,12.900000,1.290000
75%,150.250000,218.825000,36.525000,45.100000,17.400000,1.740000
max,200.000000,296.400000,49.600000,114.000000,27.000000,2.700000

In [85]:
#perform following tasks
df= pd.read_csv('./Salaries.csv')

In [86]:
print(df.head())

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [87]:
print(df.head(10))

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [96]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [95]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [97]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [98]:
shape = df.shape
print("Shape = {}".format(shape))

Shape = (33, 2)

In [99]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [101]:
df.dtypes

YearsExperience    float64
Salary               int64
dtype: object